In [69]:
import pandas as pd
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split
from sklearn.metrics import r2_score

In [5]:
credit_data=pd.read_csv("Credit.csv")
credit_data.head()

,Unnamed: 0,Income,Limit,Rating,Cards,Age,Education,Gender,Student,Married,Ethnicity,Balance
0,1,14.891,3606,283,2,34,11,Male,No,Yes,Caucasian,333
1,2,106.025,6645,483,3,82,15,Female,Yes,Yes,Asian,903
2,3,104.593,7075,514,4,71,11,Male,No,No,Asian,580
3,4,148.924,9504,681,3,36,11,Female,No,No,Asian,964
4,5,55.882,4897,357,2,68,16,Male,No,Yes,Caucasian,331

In [7]:
credit_data.keys()

Index(['Unnamed: 0', 'Income', 'Limit', 'Rating', 'Cards', 'Age', 'Education',
       'Gender', 'Student', 'Married', 'Ethnicity', 'Balance'],
      dtype='object')

In [6]:
credit_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 12 columns):
Unnamed: 0    400 non-null int64
Income        400 non-null float64
Limit         400 non-null int64
Rating        400 non-null int64
Cards         400 non-null int64
Age           400 non-null int64
Education     400 non-null int64
Gender        400 non-null object
Student       400 non-null object
Married       400 non-null object
Ethnicity     400 non-null object
Balance       400 non-null int64
dtypes: float64(1), int64(7), object(4)
memory usage: 37.6+ KB

In [8]:
credit_data.describe()

,Unnamed: 0,Income,Limit,Rating,Cards,Age,Education,Balance
count,400.000000,400.000000,400.000000,400.000000,400.000000,400.000000,400.000000,400.000000
mean,200.500000,45.218885,4735.600000,354.940000,2.957500,55.667500,13.450000,520.015000
std,115.614301,35.244273,2308.198848,154.724143,1.371275,17.249807,3.125207,459.758877
min,1.000000,10.354000,855.000000,93.000000,1.000000,23.000000,5.000000,0.000000
25%,100.750000,21.007250,3088.000000,247.250000,2.000000,41.750000,11.000000,68.750000
50%,200.500000,33.115500,4622.500000,344.000000,3.000000,56.000000,14.000000,459.500000
75%,300.250000,57.470750,5872.750000,437.250000,4.000000,70.000000,16.000000,863.000000
max,400.000000,186.634000,13913.000000,982.000000,9.000000,98.000000,20.000000,1999.000000

In [21]:
gend=pd.get_dummies(credit_data.Gender,drop_first=True)

In [22]:
stud=pd.get_dummies(credit_data.Student,drop_first=True)

In [23]:
marr=pd.get_dummies(credit_data.Married,drop_first=True)

In [24]:
ethni=pd.get_dummies(credit_data.Ethnicity,drop_first=True)

In [27]:
credit_data.keys()

Index(['Unnamed: 0', 'Income', 'Limit', 'Rating', 'Cards', 'Age', 'Education',
       'Gender', 'Student', 'Married', 'Ethnicity', 'Balance'],
      dtype='object')

In [35]:
data=pd.concat([credit_data.Income,credit_data.Rating,credit_data.Cards,credit_data.Age,credit_data.Education,gend,stud,marr,ethni,credit_data.Limit],axis=1)

In [36]:
data

,Income,Rating,Cards,Age,Education,Male,Yes,Yes,Asian,Caucasian,Limit
0,14.891,283,2,34,11,1,0,1,0,1,3606
1,106.025,483,3,82,15,0,1,1,1,0,6645
2,104.593,514,4,71,11,1,0,0,1,0,7075
3,148.924,681,3,36,11,0,0,0,1,0,9504
4,55.882,357,2,68,16,1,0,1,0,1,4897
...,...,...,...,...,...,...,...,...,...,...,...
395,12.096,307,3,32,13,1,0,1,0,1,4100
396,13.364,296,5,65,17,1,0,0,0,0,3838
397,57.872,321,5,67,12,0,0,1,0,1,4171
398,37.728,192,1,44,13,1,0,1,0,1,2525
399,18.701,415,5,64,7,0,0,0,1,0,5524

In [41]:
x=data.drop("Limit",axis=1)
x.head(2)
# or x=data.iloc(:,0:10)

    Income  Rating  Cards  Age  Education  Male  Yes  Yes  Asian  Caucasian
0   14.891     283      2   34         11     1    0    1      0          1
1  106.025     483      3   82         15     0    1    1      1          0

In [45]:
y=data.iloc[:,-1]
y.head(2)

0    3606
1    6645
Name: Limit, dtype: int64

In [47]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.20)

In [48]:
lr=LinearRegression()

In [49]:
lr.fit(x_train,y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [51]:
# prediction
y_pred=lr.predict(x_test)

In [61]:
y_pred[0]

10616.57858434165

In [62]:
y_test

390    10578
237     5149
272     3690
28     13414
130     3821
       ...
396     3838
151     4831
356     6090
65      4160
160     4865
Name: Limit, Length: 80, dtype: int64

In [64]:
# r2_score

In [65]:
r2_score(y_test,y_pred)

0.9958305254463082

In [66]:
# accuracy
lr.score(x_test,y_test)

0.9958305254463082